[UI_TREE]
Machine=硬件设置
POWER=电源特性
TOUCH=脚踏设置

[IPG,CO2]
MPULSE_FREQ=维持脉冲频率(khz)
MPULSE_RELS=维持释放时间(us)

[IPG]
MO_DELAY_STEPS=MO延迟(us)
MODECHG_DELAY=模式切换延时(ms)

[YAG,DP,EP,LD]
WORK_CURRENT_TYPE=进入对话框电流取值
WORK_CURRENT_TYPEOption=第0层电流|设定值
WORK_CURRENT=设定工作电流(A)
[ALL]
SAFE_DOOR=安全门保护
SAFE_DOOROption=无效|暂停|中止
MARKEND_SCAN=打标结束振镜位置
MARKEND_SCANOption=原点|左上角|顶部中心位置|右上角|右侧中心处|右下角|底部中心位置|左下角|左侧中心位置|自定义位置
MARKEND_X=自定义时X坐标(mm)
MARKEND_Y=自定义时Y坐标(mm)

[SCAN]
PREHEAT_ENABLE=振镜是否需要预热
PREHEAT_ENABLEOption=否|是
PREHEAT_TIME=最小预热时间(分)
USE_LIMIT_JUMPDELAY=是否启用跳转延时
USE_LIMIT_JUMPDELAYOption=否|是
LIMIT_JUMPLEN=限制跳转距离(mm)
LIMIT_JUMPDELAY_MM=每mm跳转时间(us)

[BitmapPower]
BitmapPower=灰度位图打标
AUT_TIME=衰减时间(us)
AUT_COFF=增益系数(0-1)

[Signal]
Signal=信号设置
Cycle=触发几次有效
MARK_CNT=一次打标命令打标几次
DELAY=触发后延时(ms)
DLY_BETWEEN_MARK=两次打标之间延时(ms)
MARK_END_DELAY=打标完成后延时(ms)
MARK_END_PULSE_W=打标结束信号长度(ms)
B_MARK_ONCE=触发模式
B_MARK_ONCEOption=电平触发|边沿触发
Enable_Loop_Mdt=脱机后循环打标
Enable_Loop_MdtOption=不启用|启用
IOSELCOUNT=I/O选文档信号数
ENABLE_CARDTOUCH=下位机触发
ENABLE_CARDTOUCHOption=不启用|启用


[UI_FACE]
ExportSysPara =导出参数...
ImportSysPara =导入参数...
Ok=确定
Cancel=取消
Apply=应用

;---------------------------------BEGIN: EMCC\HansLaserSet.dll-----------------------------------------
[DIALOG_LASERSET]
0=激光器硬件参数设置向导
1=上一步
2=下一步
3=保存
4=取消

[DIALOG_POWER]
0=第二步：设置您所选激光器的硬件配置
1=电流调节范围(%)
2=最小电流(%):
3=最大电流(A):
4=模拟Q驱
5=数字Q驱
6=Q驱类型
7=电源类型
8=CO2激光器功率大小
9=普通电源
10=快速响应电源
11=大于或等于100W
12=小于100W
13=维持脉冲设置
14=频率(KHZ)
15=释放时间(us)
16=空闲电流(%):
17=最大占空比
18=补偿电流(%):
19=激光器硬件设置
20=M值设置
21=M值:
22=调整系数:
23=正常
24=过大
25=过小

[DIALOG_MODEL]
0=第四步：根据您的喜好，选择您喜欢的控制方式
1=一种全新的控制方式，操作简单，使用者不需设置任何延时,但只能在部分激光器上使用。
2=传统激光控制方式，符合大多数人的使用习惯，所有激光器都能使用此方式。
3=简便模式
4=传统模式
5=激光打标控制模式
6=方头类型
7=单头模式
8=双头模式

[DIALOG_LaserType]
0=激光器类型:
1=YAG激光器
2=DP激光器
3=紫外激光器
4=CO2激光器
5=调Q光纤激光器
6=SPI激光器
7=LD激光器
8=YLPM(HFM-H)激光器
9=YLP-V2激光器
10=YLPP激光器
11=HFM-A激光器
12=HFM-P激光器
13=HFM-R激光器
14=HFM-J激光器
15=MOPA可调脉宽激光器
16=连续光纤激光器
17=超快激光器


[DIALOG_CONTENT]
0=第五步：恭喜您，您的设置已经全部完成，请保存相关参数

[LaserType_Explain]
0=YAG激光器
1=DP激光器
2=紫外激光器
3=CO2激光器
4=调Q光纤激光器
5=SPI激光器
6=LD激光器
7=MoPa光纤激光器
8=YLP-V2激光器
9=YLPP激光器
10=HFM-A激光器
11=HFM-P激光器
12=HFM-Q激光器
13=HFM-J激光器
14=other

[Model_Explain]
0=CO2 简便模式
1=CO2 传统模式
2=调Q、普通电源+数字Q 传统模式
3=调Q、普通电源+模拟Q 传统模式
4=调Q、快速响应电源+数字Q 传统模式
5=调Q、快速响应电源+模拟Q 传统模式
6=调Q、普通电源+模拟Q 简便模式
7=调Q、快速响应电源+数字Q 简便模式
8=调Q、快速响应电源+模拟Q 简便模式
9=IPG 模式
10=SPI 简便模式
11=SPI 传统模式
12=LD 模式
13=YLPM(HFM-H) 传统模式
14=YLPM(HFM-H) 简便模式
15=YLP-V2 传统模式
16=YLP-V2 简便模式
17=YLPP 传统模式
18=YLPP 简便模式
19=HFM-A 传统模式
20=HFM-A 简便模式
21=HFM-P 传统模式
22=HFM-P 简便模式
23=HFM-R 传统模式
24=HFM-R 简便模式
25=HFM-J 传统模式
26=HFM-J 简便模式

[DIALOG_ScanType]
0=第三步: 设置振镜类型
1=自制振镜
2=其它振镜
3=提示:请正确选择机器对应的振镜类型, 自制振镜上电后需要预热才能正常工作,其它振镜无需预热

;---------------------------------End: EMCC\HansLaserSet.dll-----------------------------------------

;---------------------------------BEGIN: EMCC\HansLaserSet.dll\PortSetDlg-----------------------------------------
[PORTDIALOGTEXT]
STATIC_0 =停止加工输入端口
STATIC_1 =停止加工输出端口
STATIC_2 =输出端口
STATIC_3 =安全门
STATIC_4 =输入端口
STATIC_5 =激光器准备好输出口
STATIC_6 =输入端口
STATIC_7 =输出端口
STATIC_8 =软件就绪输出口
STATIC_9 =输出端口
STATIC_10 =激光电源输出口
STATIC_11 =端口
STATIC_12 =外部红光指示输出
STATIC_13 =输出端口
STATIC_14 =输入端口
STATIC_15 =打标伴随
STATIC_16 =输出端口
STATIC_17 =标刻结束输出口
STATIC_18 =输出端口
STATIC_19 =脉冲宽度
STATIC_20 =光纤激光器报警输出口
STATIC_21 =输出端口
STATIC_22 =开始标刻端口
STATIC_23 =输入端口
IDC_CHECK_LASERWARN =检测激光器报警
IDC_CHECK_PLUSE_REVERSE = Q信号电平反转
IDC_RADIO_NORMAL = 标准
IDC_RADIO_BICOLORLAMP = 双色灯
IDC_RADIO_TRICOLORLIGHT = 三色灯

[error]
1=卡未初始化或找不到卡！
2=复位失败！
3=卡版本不对！
4=报警！
6=执行失败！
7=状态不对应!
16=命令超时！
17=命令丢失!
18=接口调用异步！
19=接口被其它程序占用!
20=Z轴超限或校正文件损坏！
21=参数不匹配!
23=内存分配失败!
100=脱机使用中!
101=命令被中止!
1001=端口1
1002=端口2
1003=端口3
1004=端口4
1005=端口5
1006=端口6
1007=端口7
1008=激光输入没有准备好
1009=激光输入准备就绪


;---------------------------------END: EMCC\HansLaserSet.dll\PortSetDlg-----------------------------------------

;---------------------------------BEGIN: EMCC\HansLaserSet.dll\HansLaserSetDlg-----------------------------------------

[TITLESTRING]
IDD_LASERSET_DIALOG=激光器设置
IDD_PROPPAGE_POWER=电源特性
IDD_PROPPAGE_SYS_SET=硬件设置
IDD_PROPPAGE_TOUCH=脚踏设置
IDD_PORT_SET = 端口设置

[IDD_DIALOG_HANSLASERSET]
CAPTION = 系统设置
IDC_BTN_SAVE= 保存
IDCANCEL= 退出
LISTTITLE_NAME= 项名称
LISTTITLE_VALUE= 值
;---------------------------------END: EMCC\HansLaserSet.dll\HansLaserSetDlg-----------------------------------------


